# print('你好{} {}'.format('hallo','world'))
# print('你好{0} {1}'.format('hallo','world'))
# print('你好{1} {1} {0} {0} {1}'.format('hallo','world'))
# print('{a} {a} {tom}'.format(tom='hallo',a='world'))

# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
# 复习：

# 变量的命名规则
# 1 由字母 数字 下划线_组成
# 2 不能以数字开头
# 3 不能包含特殊符号
# 4 不能将保留字作为变量名
# 5 不建议使用汉字

# ['False', 'None', 'True', 'and', 'as',
#  'assert', 'async', 'await', 'break',
#  'class', 'continue', 'def', 'del',
#  'elif', 'else', 'except', 'finally',
#   'for', 'from', 'global', 'if', 'import',
#    'in', 'is', 'lambda', 'nonlocal',
#    'not', 'or', 'pass', 'raise', 'return',
#     'try', 'while', 'with', 'yield']

# print(1 and 3)

# print(1 or 3)

# print(0 and 4)

# print(0 or 2)

# print(2 and 3)

# print(1 or 0)

# 已知a为三位数，以下哪个指令可以求出a的十位上的数字？（  ）
#      213
# A、m = a//100%10
# B、m = a//10%10
# C、m = a%100%10
# D、m =a//100//10


# for i in range(5):
#     print('这是外层循环', i)
#     for i in range(3):
#         print('这是内层循环', i)


# a = 1
# for i in range(10):
#     for i in range(5):
#         a += 1
# print(a)


# -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
